Autodesk.Revit.DB.BuiltInFailures.CutFailures.InstanceNotCuttingAnything
Instance(s) of [Symbol] not cutting anything.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.HostCutoutForInsertionFailure
Can't cut host for inserted objects

Autodesk.Revit.DB.BuiltInFailures.CutFailures.DormerCutProblemWarn
Dormer Opening Cut is not fully defined. Cut was not performed.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.DormerCutProblem
Dormer Opening Cut is not fully defined. Cut was not performed.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CutoutNotCuttingAnythingDeleteOpening
Opening not cutting anything.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CutoutNotCuttingAnything
Opening not cutting anything.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CutExactlyHalf
Can't cut in half. Move plane towards either end.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CantCutHostWithInstance
Can't cut host with instance.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutRoofError
The roof couldn't be cut.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutRoof
The roof couldn't be cut.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutJoinedElement
Can't cut joined element.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutInstanceOutWarn
Can't cut instance of [Symbol] out of Wall.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutInstanceOutGenWarn
Can't cut instance(s) of [Symbol] out of its host.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutInstanceOutGenError
Can't cut instance(s) of [Symbol] out of its host.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutInstanceOutGen
Can't cut instance(s) of [Symbol] out of its host.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutInstanceOutError
Can't cut instance of [Symbol] out of Wall.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutInstanceOut
Can't cut instance of [Symbol] out of Wall.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutGeometryWarn
Elements do not intersect.

Autodesk.Revit.DB.BuiltInFailures.CutFailures.CannotCutGeometry
Elements do not intersect.

Autodesk.Revit.DB.BuiltInFailures.CutFailures
Failures about Cut.